## Data Loading, Storage, and File Formats

## 6.1 Reading and Writing Data in Text Format.

In [1]:
import pandas as pd
import numpy as np

In [4]:
filename = 'data/ex1.csv'

In [5]:
df = pd.read_csv(filename)
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [10]:
pd.read_csv('data/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [9]:
!cat data/ex2.csv

'cat' is not recognized as an internal or external command,
operable program or batch file.

In [11]:
pd.read_csv('data/ex2.csv', names=['a','b','c','d','messages'])

   a   b   c   d messages
0  1   2   3   4    hello
1  5   6   7   8    world
2  9  10  11  12      foo

In [13]:
names=['a','b','c','d','message']
pd.read_csv('data/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [14]:
pd.read_csv('data/csv_mindex.csv', index_col=['key1', 'key2'])

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [1]:
list(open('data/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [4]:
result = pd.read_table('data/ex3.txt', sep='\s+')

In [5]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [7]:
pd.read_csv('data/ex4.csv', skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [9]:
result = pd.read_csv('data/ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [10]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [11]:
result = pd.read_csv('data/ex5.csv',na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [14]:
sentinels = {'message':['foo', 'NA'], 
            'something':['two']}

In [15]:
pd.read_csv('data/ex5.csv',na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

## Reading text files in Pieces

In [18]:
pd.options.display.max_rows = 10

In [19]:
result = pd.read_csv('data/ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [20]:
result = pd.read_csv('data/ex6.csv', nrows=5)
result

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [21]:
chunker = pd.read_csv('data/ex6.csv', chunksize=1000)
chunker

In [22]:
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value =0)

tot = tot.sort_values(ascending = False
                     )

C:\Users\NEXT\AppData\Local\Temp\ipykernel_11240\1250588842.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  tot = pd.Series([])

In [23]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

## Writing to Text Format:

In [26]:
data = pd.read_csv('data/ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [27]:
data.to_csv('data/out.csv')

In [28]:
import sys

In [30]:
data.to_csv(sys.stdout, sep="|", na_rep='NULL')

|something|a|b|c|d|message
0|one|1|2|3.0|4|NULL
1|two|5|6|NULL|8|world
2|three|9|10|11.0|12|foo

In [31]:
data.to_csv(sys.stdout, sep="|", na_rep='NULL', index=False, header=False)

one|1|2|3.0|4|NULL
two|5|6|NULL|8|world
three|9|10|11.0|12|foo

In [32]:
data.to_csv(sys.stdout, sep="|", na_rep='NULL', columns=['a','b'])

|a|b
0|1|2
1|5|6
2|9|10

In [35]:
dates = pd.date_range('1/1/2000', periods=7)
ts = pd.Series(np.arange(7), index=dates)
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int32

## Workign with Delimited Format

In [36]:
import csv

f = open('data/ex7.csv')
reader = csv.reader(f)

In [37]:
for line in reader: 
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [49]:
with open('data/ex7.csv') as f:
    lines = list(csv.reader(f))

In [50]:
header, values = lines[0], lines[1:]

In [51]:
data_dict = {h:v for h,v in zip(header, zip(*values))}

In [52]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [55]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar ='"'
    quoting = csv.QUOTE_MINIMAL

#reader = csv.reader(f, dialect = my_dialect)

In [57]:
with open('data/mydata.csv','w') as f:
    writer = csv.writer(f, dialect = my_dialect)
    writer.writerow(('one','two','three'))
    writer.writerow(('1','2','3'))
    writer.writerow(('1','2','3'))
    writer.writerow(('1','2','3'))

## JSON

In [59]:
obj ="""
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
 {"name": "Katie", "age": 38,
 "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [60]:
obj

'\n{"name": "Wes",\n "places_lived": ["United States", "Spain", "Germany"],\n "pet": null,\n "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},\n {"name": "Katie", "age": 38,\n "pets": ["Sixes", "Stache", "Cisco"]}]\n}\n'

In [62]:
import json
result = json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [63]:
json.dumps(result)

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [65]:
siblings = pd.DataFrame(result['siblings'], columns=['name','age'])
siblings

    name  age
0  Scott   30
1  Katie   38

In [66]:
data = pd.read_json('data/example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [67]:
data.to_json()

'{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}'

In [68]:
data.to_json(orient='records')

'[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]'

## XML and HTML Web Scraping

In [2]:
pip install lxml

Requirement already satisfied: lxml in c:\users\next\miniconda3\lib\site-packages (4.9.1)
Note: you may need to restart the kernel to use updated packages.

In [3]:
pip install beautifulsoup4 html5lib

Requirement already satisfied: beautifulsoup4 in c:\users\next\miniconda3\lib\site-packages (4.11.1)
Collecting html5lib
  Downloading html5lib-1.1-py2.py3-none-any.whl (112 kB)
Requirement already satisfied: soupsieve>1.2 in c:\users\next\miniconda3\lib\site-packages (from beautifulsoup4) (2.3.1)
Requirement already satisfied: webencodings in c:\users\next\miniconda3\lib\site-packages (from html5lib) (0.5.1)
Requirement already satisfied: six>=1.9 in c:\users\next\miniconda3\lib\site-packages (from html5lib) (1.16.0)
Installing collected packages: html5lib
Successfully installed html5lib-1.1
Note: you may need to restart the kernel to use updated packages.

In [4]:
tables = pd.read_html('data/fdic_failed_bank_list.html')

In [5]:
len(tables)

1

In [6]:
failure = tables[0]

In [7]:
failure.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [9]:
close_timestamps = pd.to_datetime(failure['Closing Date'])
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, dtype: int64

In [10]:
from lxml import objectify

In [11]:
path = 'data/mta_perf/Performance_MNR.xml'
parsed = objectify.parse(open(path))
root = parsed.getroot()

In [12]:
data = []
skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ','DESIRED_CHANCE','DECIMAL_PLACES']

In [14]:
for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [15]:
perf = pd.DataFrame(data)
perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,DESIRED_CHANGE,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,U,%,95.0,96.9,95.0,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,U,%,95.0,96.0,95.0,95.0
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,U,%,95.0,96.3,95.0,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,U,%,95.0,96.8,95.0,98.3
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,U,%,95.0,96.6,95.0,95.8

In [16]:
# 6.2 Binary Data Formats. 
frame = pd.read_csv('data/ex1.csv')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [17]:
frame.to_pickle('data/frame_pickel')

In [18]:
pd.read_pickle('data/frame_pickel')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [2]:
# Using HDF5 Format

frame = pd.DataFrame({'a':np.random.randn(100)})
store = pd.HDFStore('mydata.h5')

store['obj1'] = frame
store['obj1_col'] = frame['a']
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [4]:
store['obj1']

           a
0  -2.069770
1  -1.446489
2  -1.099100
3  -0.389604
4   0.111042
..       ...
95  0.333062
96 -0.889016
97 -0.879627
98 -1.495849
99  0.566703

[100 rows x 1 columns]

In [6]:
# Reading Excel
# xls = pd.read_excel('data/ex1.xlsx') openpyxl

## 6.3 Interacting with Wen API's

In [9]:
import requests

url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

resp = requests.get(url)
resp

In [14]:
data = resp.json()
data[0]['title']

'TYP: remove a mypy ignore from reshape/merge.py'

In [16]:
issues = pd.DataFrame(data, columns=['number', 'title','label','state'])
issues

    number                                              title  label state
0    48133    TYP: remove a mypy ignore from reshape/merge.py    NaN  open
1    48131                    DEPR: inplace keyword in rename    NaN  open
2    48130                     DEPR: set_axis inplace keyword    NaN  open
3    48129  BUG: Fixed inconsistent offset behavior for se...    NaN  open
4    48126                 POC/REF: remove axes from Managers    NaN  open
5    48125  BUG: #39448 fixed dropna to return copy correctly    NaN  open
6    48124  BUG: using NamedTuples with .loc works only so...    NaN  open
7    48123  BUG: inconsistent behaviour of the method `.id...    NaN  open
8    48122  BUG: Parsing ISO 8601 duration time components...    NaN  open
9    48120                                              1.4.x    NaN  open
10   48119                   WEB: Update inactive maintainers    NaN  open
11   48117                        ENH: droplevel copy keyword    NaN  open
12   48116  Revert Interval/IntervalIndex/interval_range.i...    NaN  open
13   48113   DOC: update contributing to pandas documentation    NaN  open
14   48111                  ENH: Add cumulative methods to ea    NaN  open
15   48110  ENH: dtype-unaware (empty) objects ("any" dtype)     NaN  open
16   48109                        ENH: Support mask in unique    NaN  open
17   48108                            DEV: add gitpod actions    NaN  open
18   48107                              DEV: Add gitpod files    NaN  open
19   48103  BUG: timedelta as value to plot barplot raises...    NaN  open
20   48101  DOC: `is_float_dtype` meant to be an internal ...    NaN  open
21   48100  DOC: Altered capitalization validation script ...    NaN  open
22   48093       TST: Filter/test pyarrow PerformanceWarnings    NaN  open
23   48091                                              QST:     NaN  open
24   48090  BUG: DataFrame.select_dtypes returns reference...    NaN  open
25   48088  ENH: move an exception and add a prehook to ch...    NaN  open
26   48086  ENH: add `regex=False` option to pandas.Series...    NaN  open
27   48085  ENH: Add axis parameter to add_prefix and add_...    NaN  open
28   48084  ENH: alleviate issues with inconsistent multi-...    NaN  open
29   48083  BUG: pd.cut creates NaNs instead of expected b...    NaN  open

# 6.4 Interacting with Database

In [17]:
import sqlite3

In [30]:
query = """
CREATE TABLE test(
A VARCHAR(20),
B VARCHAR(20),
C REAL, 
D INTEGER);
"""

In [31]:
con = sqlite3.connect('mydata.sqlite')

In [32]:
con.execute(query)

OperationalError: table test already exists

In [33]:
con.commit()

In [34]:
data = [('Atlanta', 'Georgia', 1.25, 6),
 .....: ('Tallahassee', 'Florida', 2.6, 3),
 .....: ('Sacramento', 'California', 1.7, 5)]

In [35]:
data

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [36]:
stmt = "INSERT into test VALUES(?,?,?,?)"

In [37]:
con.executemany(stmt, data)

In [38]:
con.commit()

In [39]:
cursor = con.execute('select * from test')

In [40]:
row = cursor.fetchall()
row

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5),
 ('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [41]:
cursor.description

(('A', None, None, None, None, None, None),
 ('B', None, None, None, None, None, None),
 ('C', None, None, None, None, None, None),
 ('D', None, None, None, None, None, None))